In [18]:
import pandas as pd
import numpy as np

In [19]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, np.nan],
                   [np.nan, 3, np.nan, 4]],
                  columns=list("ABCD"))

In [20]:
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

In [21]:
df.isnull().sum()

A    3
B    1
C    4
D    1
dtype: int64

In [22]:
df['A'].fillna('Earth', inplace=True)

In [23]:
df

       A    B   C    D
0  Earth  2.0 NaN  0.0
1    3.0  4.0 NaN  1.0
2  Earth  NaN NaN  NaN
3  Earth  3.0 NaN  4.0

In [24]:
df.isnull().sum()

A    0
B    1
C    4
D    1
dtype: int64